Repository: zwubishet/Adey_child_care_assistance_app
Catalog: lib/l10n/arb/lang_*.arb
Languages: am

# pageTitleNotificationDetail
source: Notification Details
am: የማሳወቂያ ዝርዝሮች

# messageLabel
source: Message
am: መልእክት

# deliveredLabel
source: Delivered: {date}
am: ተልኳል: {date}

# seenLabel
source: Seen
am: ተመልክቷል

# unreadLabel
source: Unread
am: አልተነበበም

# relevanceLabel
source: Relevance
am: ጠቀሜት

# pageTitleNotificationHistory
source: Notification History
am: የማሳወቂያ ታሪክ

# noNotifications
source: No notifications yet
am: ገና ምንም ማሳወቂያ የለም

# errorLabel
source: Error: {error}
am: ስህተት: {error}

# pageTitleCommunity
source: Community
am: ማህበረሰብ

source: What's on your mind?
am: ምን እያሰብክ ነው

# noPosts
source: No posts yet. Create a new one!
am: ምንም ልጥፍ የለም። አዲስ ፍጠር

# pageTitleProfile
source: Profile
am: መገለጫ

source: Language Settings
am: የቋንቋ ቅንብሮች

# languageEnglish
source: English
am: እንግሊዝኛ

# languageAmharic
source: Amharic
am: አማርኛ

source: View Notification
am: ማሳወቂያ ተመልከት

# pageTitleHome
source: Home
am: መነሻ

# pageTitleHealthMetrics
source: Health Metrics
am: የጤና መለኪያዎች

# pageTitleEducation
source: Education
am: ትምህርት

# pageTitleFavorites
source: Favorites
am: ተወዳጆች

# pageTitleWeeklyTip
source: Weekly Tip
am: ሳምንታዊ ምክር

# pageTitleJournal
source: Journal
am: ዕለታዊ ማስታወሻ

# greeting
source: Hello, {name}!
am: ሰላም፣ {name}!

source: Pregnancy Journey
am: የእርግዝና ጉዞ

# weeksLabel
source: Weeks
am: ሳምንታት

# daysLabel
source: Days
am: ቀናት

source: Weekly Tips
am: ሳምንታዊ ምክሮች

# noTipsYet
source: No tips yet—add some!
am: እስካሁን ምንም ምክሮች የሉም—ጥቂት ያክሉ!

source: Explore Features
am: ተግባራትን ያስሱ

# featureCalendar
source: Calendar
am: ቀን መቁጠሪያ

# featureCalendarDescription
source: Plan appointments
am: ቀጠሮዎችን መርሐ ግብር ያስይዙ

# featureHealthMetrics
source: Health Metrics
am: የጤና መለኪያዎች

# featureHealthMetricsDescription
source: Track your health
am: ጤናዎን ይፈትሹ

# featureJournal
source: Journal
am: ዕለታዊ ማስታወሻ

# featureJournalDescription
source: Write your thoughts
am: ሀሳቦችዎን ይፃፉ

# featureNameSuggestion
source: Name Suggestion
am: ስም መጠየቅ

# featureNameSuggestionDescription
source: Find baby names
am: የሕፃን ስሞችን ይፈልጉ

source: No user logged in
am: ምንም ተጠቃሚ አልገባም

# failedToLoadProfile
source: Failed to load profile: {error}
am: መገለጫ መጫን አልተሳካም: {error}

# weekLabel
source: Week
am: ሳምንት {week}

# pageTitleHealthArticle
source: Health Article
am: የጤና ጽሑፍ

# noDiaryEntries
source: No diary entries yet
am: እስካሁን ምንም የዴስክ ግቤቶች የሉም።

# errorLoadingEntries
source: Error loading entries: {error}
am: ግቤቶችን መጫን ላይ ስህተት: {error}

source: Added to favorites!
am: ወደ ተወዳጆች ተጨምሯል!

source: Removed from favorites!
am: ከተወዳጆች ተወግዷል!

# errorUpdatingFavorite
source: Error updating favorite: {error}
am: ተወዳጅ ማዘመን ላይ ስህተት: {error}

source: No Content
am: ይዘት የለም

# moreButton
source: More >>>
am: ተጨማሪ >>>

# lessButton
source: Less >>>
am: ያነሰ >>>

# postedAt
source: Posted at: {date}
am: ተለጠፈ በ: {date}

# weekLabelWithNumber
source: Week {week}
am: ሳምንት {week}

# favoriteEntriesTitle
source: Favorite Entries
am: ተወዳጅ ግቤቶች

# noFavoriteEntries
source: No favorite entries yet
am: እስካሁን ምንም ተወዳጅ ግቤቶች የሉም።

# refreshButton
source: Refresh
am: አድስ

source: Show More >>>
am: ተጨማሪ >>>

source: Show Less >>>
am: ያነሰ >>>

# postedAtLabel
source: Posted at
am: የተለጠፈበት ቀን

# bottomNavHome
source: Home
am: መነሻ

# bottomNavCommunity
source: Community
am: ማህበረሰብ

# bottomNavEducation
source: Education
am: ትምህርት

# bottomNavConsult
source: Consult
am: አማካሪ

source: Failed to load user data
am: የተጠቃሚ ውሂብ መጫን አልተሳካም

# errorLoadingData
source: Error occurred: {error}
am: ስህተት ተከስቷል: {error}

source: Consult Page (Coming Soon)
am: የአማካሪ ገፅ (በቅርቡ ይመጣል)

# editProfileTitle
source: Edit Profile
am: መገለጫ አርትዕ

source: Choose from Gallery
am: ከጋለሪ ምረጥ

source: Take Photo
am: ፎቶ አንሳ

source: Personal Information
am: የግል መረጃ

# fullNameLabel
source: Full Name
am: ሙሉ ስም

# ageLabel
source: Age
am: ዕድሜ

# weightLabel
source: Weight
am: ክብደት

# heightLabel
source: Height
am: ቁመት

# bloodPressureLabel
source: Blood Pressure (e.g., 120/80)
am: የደም ግፊት (ለምሳሌ፣ 120/80)

# selectHealthConditions
source: Select applicable health conditions
am: ተፈጻሚ የጤና ሁኔታዎችን ምረጥ

# describeHealthIssue
source: Describe your health issue
am: የጤና ችግርህን ግለጽ

# healthIssueHint
source: Describe your health background or issues here...
am: የጤና ታሪክዎን ወይም ችግሮችዎን እዚህ ይግለፁ...

# saveProfileButton
source: Save Profile
am: መገለጫ አስቀምጥ

# failedToUpdateProfile
source: Failed to update profile: {error}
am: መገለጫ ማዘመን አልተሳካም: {error}

source: Camera permission denied
am: የካሜራ ፍቃድ ተከልክሏል

source: Gallery permission denied
am: የጋለሪ ፍቃድ ተከልክሏል

# imageTooLarge
source: Image is too large, please choose a smaller one
am: ምስሉ በጣም ትልቅ ነው፣ እባክህ ትንሽ ምረጥ

# errorPickingImage
source: Error picking image: {error}
am: ምስል መምረጥ ላይ ስህተት: {error}

source: Profile updated successfully!
am: መገለጫ በተሳካ ሁኔታ ታድሷል!

# weightUnit
source: {unit, select, kg {kg} lbs {lbs} other {{unit}}}
am: {unit, select, kg {ኪግ} lbs {ፓውንድ} other {{unit}}}

# heightUnit
source: {unit, select, cm {cm} ft {ft} other {{unit}}}
am: {unit, select, cm {ሴሜ} ft {ፊት} other {{unit}}}

# healthCondition
source: {condition, select, diabetes {Diabetes} hypertension {Hypertension} asthma {Asthma} heartDisease {Heart Disease} thyroidIssues {Thyroid Issues} other {Other} other {{condition}}}
am: {condition, select, diabetes {ስኳር በሽታ} hypertension {ከፍተኛ የደም ግፊት} asthma {አስም} heartDisease {የልብ በሽታ} thyroidIssues {የታይሮይድ ችግሮች} other {ሌላ} other {{condition}}}

# errorMarkingAsSeen
source: Error marking as seen: {error}
am: እንደተመለከተ ምልክት ማድረግ ላይ �ስህተት: {error}

source: Tap to view
am: መታ ያድርጉ ለመመልከት

# notificationChannelName
source: Daily Tip
am: የየቀኑ ምክር

# notificationChannelDescription
source: Health tips every 4 days
am: የጤና ምክሮች በየ4 ቀናት

# fallbackTipTitle
source: Tip {index}
am: ምክር {index}

# fallbackTipBody
source: Consult your doctor for advice.
am: ለመከረው ሐኪምዎን ያማክሩ።

# relevanceLabelWithValue
source: Relevance: {value}
am: ተገቢነት: {value}

# genderLabel
source: Gender
am: ጾታ

# genderSelectionError
source: Please select a gender
am: እባክዎ ጾታ ይምረጡ

source: Enter Health Data
am: የጤና ውሂብ ያስገቡ:

# heartRateLabel
source: Heart Rate (BPM)
am: የልብ መጠጥ (bpm)

# bodyTemperatureLabel
source: Body Temperature (°C)
am: የሰውነት ሙቀት (°C)

# weightLabelKg
source: Weight (kg)
am: ክብደት (ኪግ)

# saveDataButton
source: Save Data
am: ውሂብ አስቀምጥ

# recommendationsTitle
source: Recommendations
am: ምክሮች:

# healthTrendsTitle
source: Health Trends
am: የጤና መልካም ሁኔታዎች:

source: No data available
am: ውሂብ የለም።

source: Data saved successfully!
am: ውሂብ በተሳካ ሁኔታ ተቀምጧል!

# failedToSaveData
source: Failed to save data. Please try again.
am: ውሂብ መቀመጥ አልተሳካም። እባክዎ እንደገና ይሞክሩ።

# invalidValuesError
source: Please enter valid values for all fields
am: እባክዎ ሁሉንም መስፈርቶች ትክክለኛ እሴቶችን ያስገቡ።

# tempScaledLabel
source: Temperature (°C x 5)
am: የሙቀት መጠን (°C x 5)

# bpLowRecommendation
source: Your blood pressure appears low (Systolic: {bpSys} mmHg, Diastolic: {bpDia} mmHg). This could be due to dehydration, fatigue, or other factors. To stabilize, consider adding a small amount of salt (e.g., a pinch in your food), drinking more water throughout the day (aim for 8-10 glasses), and eating small, frequent meals. If you feel dizzy or faint often, consult a healthcare professional to rule out other issues.
am: የደም ግፊትህ ዝቅተኛ እንደሆነ ይመስላል (Systolic: {bpSys} mmHg, Diastolic: {bpDia} mmHg)። ይህ በውሃ እጥበት፣ በመቀነስ ወይም በሌሎች ምክንያቶች ሊኖር ይችላል። ለመቀነስ የሚረዱበትን ጥሩ የጤና መልካም ሁኔታ ይቀጥሉ፣ በየቀኑ ውሃ መጠጣትን ያሳድጉ (8-10 ጋላ ይዘት) እና የእህቴ ምግብ መቀነስ ይፈልጉ። ከዚያም በተለቀቀ ጊዜ ለማስጠበቅ ለመንገድ እና ለማደንቀፍ ከሆነ ለማድረግ ለመልካም አቅም የሚያስፈልግ ነው።

# bpHighRecommendation
source: Your blood pressure is elevated (Systolic: {bpSys} mmHg, Diastolic: {bpDia} mmHg), which may indicate hypertension. To manage, reduce salt intake by avoiding processed foods and choosing fresh ingredients, engage in moderate exercise like brisk walking or cycling for 30 minutes most days of the week, and practice stress reduction techniques like yoga or deep breathing for 10-15 minutes daily. If this persists across multiple readings, consider seeing a doctor for a detailed evaluation.
am: የደም ግፊትህ ከፍተኛ ነው (Systolic: {bpSys} mmHg, Diastolic: {bpDia} mmHg)፣ ይህም ሊያመልክት የሚችል ነው የከፍተኛ የደም ግፊት ነው። ለመቀነስ የሚረዱበትን ጥሩ የጤና መልካም ሁኔታ ይቀጥሉ፣ በየቀኑ ውሃ መጠጣትን ያሳድጉ (8-10 ጋላ ይዘት) እና የእህቴ ምግብ መቀነስ ይፈልጉ። ከዚያም በተለቀቀ ጊዜ ለማስጠበቅ ለመንገድ እና ለማደንቀፍ ከሆነ ለማድረግ ለመልካም አቅም የሚያስፈልግ ነው።

# bpNormalRecommendation
source: Your blood pressure (Systolic: {bpSys} mmHg, Diastolic: {bpDia} mmHg) is within the normal range. To maintain this, continue a balanced diet rich in fruits, vegetables, and lean proteins, and get at least 150 minutes of moderate exercise per week. Monitoring trends over time helps ensure it stays stable.
am: የደም ግፊትህ (Systolic: {bpSys} mmHg, Diastolic: {bpDia} mmHg) መደበኛ ነው። ይህን ለመቀነስ የሚረዱበትን ጥሩ የጤና መልካም ሁኔታ ይቀጥሉ፣ በየቀኑ ውሃ መጠጣትን ያሳድጉ (8-10 ጋላ ይዘት) እና የእህቴ ምግብ መቀነስ ይፈልጉ። ከዚያም በተለቀቀ ጊዜ ለማስጠበቅ ለመንገድ እና ለማደንቀፍ ከሆነ ለማድረግ ለመልካም አቅም የሚያስፈልግ ነው።

# hrLowRecommendation
source: Your heart rate ({hr} BPM) is on the lower side. This can be normal for fit individuals, but if you're not highly active or feel unusually tired, it's worth monitoring. To boost cardiovascular health, include activities like jogging, swimming, or dancing a few times a week for 20-30 minutes. If your heart rate drops further or you experience symptoms like dizziness, consult a doctor.
am: የልብ መጠጡ ({hr} bpm) ዝቅተኛ ነው። ይህ ለጤና ያለፈ ሰዎች መደበኛ ነው፣ ግን ከፍተኛ አይነት እንቅስቃሴ አልተካሄድም ወይም መቀነስ እንደሚሰማብዎ መመከር ይገባል። የልብ መጠጥን ለመጨመር እንቁስቋሴዎን ያሳድጉ በሚያደርግበት ጊዜ የልብ መጠጡን ያረጋግጡ።

# hrHighRecommendation
source: Your heart rate ({hr} BPM) is elevated, which could be due to stress, caffeine, or physical activity. To lower it, try relaxation techniques like deep breathing exercises (inhale for 4 seconds, exhale for 6 seconds) or meditation for 10-15 minutes daily. Limit stimulants like coffee or energy drinks, and ensure you're getting 7-9 hours of sleep. If consistently high, a medical evaluation may be needed.
am: የልብ መጠጡ ({hr} bpm) ከፍተኛ ነው፣ ይህም በጭንቀት፣ በቡና ወይም በግብዓት ሊኖር ይችላል። ለመቀነስ የልብ መጠጡን ያረጋግጡ በሚያደርግበት ጊዜ የልብ መጠጡን ያረጋግጡ።

# hrNormalRecommendation
source: Your heart rate ({hr} BPM) is in a healthy range. To maintain this, continue a regular schedule of moderate physical activities like walking or cycling and manage stress effectively with hobbies or relaxation practices. Keep monitoring to spot any unusual changes.
am: የልብ መጠጡ ({hr} bpm) መደበኛ ነው። ይህን ለመቀነስ የልብ መጠጡን ያረጋግጡ በሚያደርግበት ጊዜ የልብ መጠጡን ያረጋግጡ።

# tempLowRecommendation
source: Your body temperature ({temp}°C) is below average, which may indicate you're cold or your metabolism is sluggish. Keep warm by wearing layers or using a blanket, and consume warm beverages like herbal tea throughout the day. Monitor for signs of illness like fatigue or chills, and if this persists, consider consulting a doctor about a thyroid test, as low body temperature can sometimes indicate hormonal imbalances.
am: የሰውነት ሙቀት ({temp}°C) ከመካከለኛ መከላከያ በታች ነው፣ ይህም በተቆጣጠረ ሁኔታ ወይም በተቀንሶ መጠን ሊኖር ይችላል። ለመቀነስ የሰውነት ሙቀትዎን ያረᜌጋግጡ በሚያደርግበት ጊዜ የሰውነት ሙቀትዎን ያረጋግጡ።

# tempHighRecommendation
source: Your body temperature ({temp}°C) is elevated, which may indicate a fever or overheating. Stay hydrated by drinking 8-12 glasses of water daily, rest in a cool environment, and avoid strenuous exercise until it subsides. If above 38°C or lasting more than a day, seek medical advice to rule out infections or other causes.
am: የሰውነት ሙቀት ({temp}°C) ከፍተኛ ነው፣ ይህም ሊያመልክት የሚችል ነው የተቆጣጠረ ሁኔታ ነው። ለመቀነስ የሰውነት ሙቀትዎን ያረጋግጡ በሚያደርግበት ጊዜ የሰውነት ሙቀትዎን ያረጋግጡ።

# tempNormalRecommendation
source: Your body temperature ({temp}°C) is normal. To maintain this, dress appropriately for the weather, stay hydrated with 6-8 glasses of water daily, and avoid extreme temperature changes. Regular monitoring helps catch any variations early.
am: የሰውነት ሙቀት ({temp}°C) መደበኛ ነው። ይህን ለመቀነስ የሰውነት ሙቀትዎን ያረጋግጢ በሚያደርግበት ጊዜ የሰውነት ሙቀትዎን ያረጋግጡ።

# weightLowRecommendation
source: Your weight ({weight} kg) is on the lower side. To gain or maintain healthy weight, focus on a nutrient-dense diet with proteins like eggs, chicken, or beans, healthy fats like nuts or avocado, and complex carbs like whole grains. Aim for 3 balanced meals and 2 snacks daily, and consider light strength training exercises like small weight lifting to build muscle mass. If struggling to gain weight, consult a dietitian.
am: ክብደትህ ({weight} kg) ዝቅተኛ ነው። ይህን ለመቀነስ የሰውነት ክብደትዎን ያረጋግጡ በሚያደርግበት ጊዜ የሰውነት ክብደትዎን ያረጋግጡ።

# weightHighRecommendation
source: Your weight ({weight} kg) is on the higher side. To manage, incorporate regular physical activity like walking, swimming, or yoga for 30-40 minutes most days of the week, and focus on a diet rich in vegetables, lean proteins, and whole grains while reducing sugary drinks and processed snacks. Set small, achievable goals (e.g., losing 0.5 kg per month) and track progress. A healthcare provider can offer tailored advice if needed.
am: ክብደትህ ({weight} kg) ከፍተኛ ነው። ይህን ለመቀነስ የሰውነት ክብደትዎን ያረጋግጡ በሚያደርግበት ጊዜ የሰውነት ክብደትዎን ያረጋግጡ።

# weightNormalRecommendation
source: Your weight ({weight} kg) is in a healthy range. To maintain this, continue a balanced diet filled with fruits, vegetables, and lean proteins, and get at least 150 minutes of moderate exercise per week. Regular weigh-ins help ensure consistency over time.
am: ክብደትህ ({weight} kg) መደበኛ ነው። ይህን ለመቀነስ የሰውነት ክብደትዎን ያረጋግጡ በሚያደርግበት ጊዜ የሰውነት ክብደትዎን ያረጋግጡ።

# bpSysIncreasedRecommendation
source: Your systolic blood pressure has increased by more than 10 mmHg from your last measurement (from {prevBpSys} to {bpSys}). This could be due to situational factors (e.g., stress or diet), but monitor closely over the next few days. Reduce salt intake, avoid caffeine before bed, and try a 10-minute relaxation exercise daily to see if it stabilizes.
am: የደም ግፊትህ (Systolic: {bpSys} mmHg) ከፍተኛ ነው ከፊተኛ መጠን (ከ{prevBpSys} ወደ {bpSys}) በላይ ነው። ይህ በጊዜ ሁኔታ ወይም በተመጣጣኝ ምግብ ሊኖር ይችላል፣ ግን በተቃራይ ጊዜ ይመከሩ።

# hrIncreasedRecommendation
source: Your heart rate has increased by more than 15 BPM compared to your previous entry (from {prevHr} to {hr}). This might reflect temporary stress or activity, but if you haven’t been exercising, consider what’s changed—too much coffee, poor sleep, or stress? Take time for a calming activity like reading or a warm bath to unwind.
am: የልብ መጠጡ ({hr} bpm) ከፊተኛ መጠን (ከ{prevHr} ወደ {hr}) በላይ ነው። ይህ በጊዜ ሁኔታ ወይም በተመጣጣኝ እንቁስቋሴ ሊኖር ይችላል፣ ግን በተቃራይ ጊዜ ይመከሩ።

# weightIncreasedRecommendation
source: Your weight has increased by more than 2 kg from your last record (from {prevWeight} to {weight}). This could be water retention or diet-related. Cut back on salty or carb-heavy meals for a few days and increase your water intake to flush out excess fluids. If persistent, reassess your calorie intake and activity level.
am: ክብደትህ ({weight} kg) ከፊተኛ መጠን (ከ{prevWeight} ወደ {weight}) በላይ ነው። ይህ በውሃ መጠጣት ወይም በተመጣጣኝ ምግብ ሊኖር ይችላል፣ ግን በተቃራይ ጊዜ ይመከሩ።

# allVitalsNormalRecommendation
source: All your latest vitals (Blood Pressure: {bpSys}/{bpDia} mmHg, Heart Rate: {hr} BPM, Temperature: {temp}°C, Weight: {weight} kg) are within normal ranges. Great job! Keep up your healthy habits, including a balanced diet, regular exercise (150 minutes per week), and consistent sleep (7-9 hours per night) to stay on track.
am: ሁሉም የመጨረሻ የጤና መለኪያዎችህ (BP: {bpSys}/{bpDia} mmHg, HR: {hr} bpm, Temp: {temp}°C, Weight: {weight} kg) መደበኛ ናቸው። በጣም ጥሩ! ጤናማ ልማቶችህን ቀጥል፣ ሚዛናዊ ምግብ፣ መደበኛ እንቅስቃሴ (ሳምንታዊ 150 ደቂቃዎች)፣ እና ተከታታይ እንቅልፍ (በሌሊት 7-9 ሰዓታት) ለመቀጠል።

# noDataRecommendation
source: No data available yet. Start entering your health metrics to receive personalized recommendations.
am: እስካሁን ውሂብ የለም። የጤና መለኪያዎችህን በማስገባት ግላዊ ምክሮችን ለመቀበል ጀምር።

# tooltipBpSys
source: Blood Pressure Sys: {value} mmHg
am: BP Sys: {value} mmHg

# tooltipHr
source: Heart Rate: {value} BPM
am: HR: {value} bpm

# tooltipTemp
source: Temperature: {value}°C
am: የሙቀት መጠን: {value}°C

# tooltipWeight
source: Weight: {value} kg
am: ክብደት: {value} kg

# boysLabel
source: Boys
am: ወንዶች

# femaleGender
source: Female
am: የሴት ጾታ

# girlsLabel
source: Girls
am: ሴቶች

# maleGender
source: Male
am: የወንድ ጾታ

# noNamesAvailable
source: No names available for {category}
am: ለ{category} ምንም ስሞች የሉም

# pageTitleNameSuggestion
source: Baby Name Suggestion
am: የሕፃን ስም መጠየቂያ

# tabAll
source: All
am: ሁሉም

# tabChristian
source: Christian
am: ክርስቲያን

# tabMuslim
source: Muslim
am: ሙስሊም

# addNoteLabel
source: Add Note
am: ማስቀመጥ ምስክር

# deleteAction
source: Delete
am: መሰረዝ

# errorDeletingNote
source: Error deleting note: {error}
am: የምስክር መሰረዝ ላይ ስህተት: {error}

# loginPrompt
source: Please log in
am: እባክህ መግባት ይፈልጋሉ

# noNotesMatchSearch
source: No notes match your search
am: ምንም ምስክሮች ከመፈለጉ ጋር አይዛመዱም

# noNotesYet
source: No notes yet. Add one!
am: እስካሁን ምንም ምስክር የለም። አንድ ያክሉ!

# searchHint
source: Search notes by title...
am: የምስክሮችን በአርዕስት መፈለግ...

# aboutSection
source: About
am: ስለ

source: Appointment Accepted
am: ቀጠሮ ተቀባይነት አግኝቷል

source: Appointment Cancelled
am: ቀጠሮ ተሰርዟል

# appointmentCancelledMessage
source: This appointment has been cancelled. The video call will end.
am: ይህ ቀጠሮ ተሰርዟል። የቪዲዮ ጥሪው ይጠናቀቃል።

# appointmentWithDoctor
source: Appointment with {doctorName}
am: {doctorName} ጋር ቀጠሮ

# appointmentsLabel
source: Appointments
am: ቀጠሮዎች

source: Available Doctors
am: የሚገኙ ዶክተሮች

source: Available Time Slots
am: የሚገኙ የጊዜ ቦታዎች፡

source: Before Joining
am: ከመቀላቀልዎ በፊት፡

source: Book Appointment
am: ቀጠሮ ይያዙ

# bookAppointmentWith
source: Book Appointment with {fullName}
am: {fullName} ጋር ቀጠሮ ይያዙ

# bookNewAppointmentTooltip
source: Book a new appointment
am: አዲስ ቀጠሮ ይያዙ

# bookingLabel
source: Booking
am: መያዣ

# callEnded
source: Call ended: {error}
am: ጥሪ አልቋል፡ {error}

source: Connected to call
am: ወደ ጥሪ ተገናኝቷል

source: Connected to server
am: ከአገልጋይ ጋር ተገናኝቷል

source: Connecting to call...
am: ወደ ጥሪ በመገናኘት ላይ...

source: Contact Information
am: የመገናኛ መረጃ

source: Copied to clipboard
am: ወደ ክሊፕቦርድ ተቀድቷል

# copyLinkTooltip
source: Copy link
am: አገናኝ ቅዳ

# couldNotCreateProfile
source: Could not create user profile. Please try again.
am: የተጠቃሚ መገለጫ መፍጠር አልተሳካም። እባክዎ እንደገና ይሞክሩ።

# doctorProfile
source: Doctor Profile: {fullName}, {speciality}
am: ዶክተር መገለጫ፡ {fullName}፣ {speciality}

# doctorRating
source: Doctor {fullName}, {speciality}, 4.5 rating
am: ዶክተር {fullName}፣ {speciality}፣ 4.5 ደረጃ

# doctorsLabel
source: Doctors
am: ዶክተሮች

# emailLabel
source: Email Address
am: ኢሜይል አድራሻ

# ensureStableConnection
source: Ensure you have a stable internet connection
am: የተረጋጋ የበይነመረብ ግንኙነት እንዳለዎት ያረጋግጡ

source: Error joining call
am: ጥሪ መቀላቀል ላይ ስህተት

# errorPrefix
source: Error
am: ስህተት

# errorSendingRequest
source: Error sending request: {error}
am: ጥያቄ መላክ ላይ ስህተት፡ {error}

# findQuietSpace
source: Find a quiet, private space for your consultation
am: ለእርስዎ ምክክር ጸጥ ያለ፣ የግል ቦታ ያግኙ

# haveQuestionsReady
source: Have your questions ready for the doctor
am: ለዶክተሩ ጥያቄዎችዎን ያዘጋጁ

source: In call
am: በጥሪ ውስጥ

source: Invalid date format
am: የተሳሳተ የቀን ቅርጸት

source: Join Now
am: አሁን ይቀላቀሉ

source: Join Video Call
am: የቪዲዮ ጥሪ ይቀላቀሉ

source: Joining...
am: በመቀላቀል ላይ...

source: Joining call...
am: ጥሪ በመቀላቀል ላይ...

source: Later
am: በኋላ

source: Meeting Information
am: የስብሰባ መረጃ

# motherAppTitle
source: Mothers App
am: የእናቶች መተግበሪያ

# navigateToAppointments
source: Navigate to Appointments page
am: ወደ ቀጠሮዎች ገፅ ይሂዱ

# navigateToBooking
source: Navigate to Booking page
am: ወደ መያዣ ገፅ ይሂዱ

# navigateToDoctors
source: Navigate to Doctors page
am: ወደ ዶክተሮች ገፅ ይሂዱ

source: New meeting link available
am: አዲስ የስብሰባ አገናኝ ይገኛል

# newMeetingLinkMessage
source: A new video conference link is available. Would you like to join with the new link?
am: አዲስ የቪዲዮ ኮንፈረንስ አገናኝ ይገኛል። በአዲሱ አገናኝ መቀላቀል ይፈልጋሉ?

# noAcceptedAppointments
source: No accepted appointments. Accepted appointments will appear here.
am: ምንም ተቀባይነት ያላቸው ቀጠሮዎች የሉም። ተቀባይነት ያገኙ ቀጠሮዎች እዚህ ይታያሉ።

# noAvailabilityFound
source: No availability found for this doctor.
am: ለዚህ ዶክተር ምንም መገኘት አልተገኘም።

source: No date available
am: ምንም ቀን የለም

source: No description available
am: ምንም መግለጫ የለም

source: No doctors available
am: ምንም ዶክተሮች የሉም

# noPendingAppointments
source: No pending appointments. Requests you send will appear here.
am: ምንም በመጠባበቅ ላይ ያሉ ቀጠሮዎች የሉም። የሚልኳቸው ጥያቄዎች እዚህ ይታያሉ።

# noRejectedAppointments
source: No rejected appointments. Rejected appointments will appear here.
am: ምንም ውድቅ የተደረጉ ቀጠሮዎች የሉም። ውድቅ የተደረጉ ቀጠሮዎች እዚህ ይታያሉ።

source: Not available
am: አይገኝም

# notConnected
source: Not connected - appointments may not be sent
am: አልተገናኘም - ቀጠሮዎች ላይላኩ ይችላሉ

source: Not specified
am: አልተገለጸም

# okLabel
source: OK
am: እሺ

# pageTitleAppointments
source: My Appointments
am: የእኔ ቀጠሮዎች

# phoneLabel
source: Phone
am: ስልክ

# pleaseSelectDateTime
source: Please select a date and time
am: እባክዎ ቀን እና ሰዓት ይምረጡ

# ratingLabel
source: 4.5 (245 reviews)
am: 4.5 (245 ግምገማዎች)

source: Ready to join
am: መቀላቀል ዝግጁ ነው

# refreshAppointmentsTooltip
source: Refresh appointments
am: ቀጠሮዎችን አድስ

source: Request Appointment
am: ቀጠሮ ጠይቅ

# requestSent
source: Appointment request sent! The doctor's response will arrive soon.
am: የቀጠሮ ጥያቄ ተልኳል! የዶክተር ፈቃድ በመጠባበቅ ላይ።

source: Reschedule Appointment
am: ቀጠሮ እንደገና ማስያዝ

# selectDateTime
source: Select Date and Time
am: ቀን እና ሰዓት ይምረጡ

# specialityLabel
source: Speciality: {speciality}
am: ልዩ ሙያ፦ {speciality}

source: Start Call
am: ጥሪ ይጀምሩ

source: Start Video Call
am: ቪዲዮ ጥሪ ይጀምሩ

# statusAccepted
source: Accepted
am: ተቀባይነት አግኝቷል

# statusCancelled
source: Cancelled
am: ተሰርዟል

# statusPending
source: Pending
am: በመጠባበቅ ላይ

# statusRejected
source: Rejected
am: ተቀባይነት አላገኘም

# timeZoneLabel
source: Time Zone: {timeZone}
am: ሰዓት ሰቅ {timeZone}

source: Upcoming Appointments
am: የቀጠሮ ቀናት

source: View Profile
am: መገለጫ ይመልከቱ

# waitingForDoctor
source: Waiting for the doctor...
am: ዶክተሩን እየጠበቅን ነው።

source: Your meeting link
am: የእርስዎ የስብሰባ አገናኝ

# retryButton
source: Retry
am: እንደገና ሞክር

# searchNotesHint
source: Search your notes...
am: የእርስዎን ማስታወሻዎች ይፈልጉ...

# pleaseLogIn
source: Please log in to continue
am: እባክዎ ለመቀጠል ይግቡ

# noteDeleted
source: Note deleted successfully
am: ማስታወሻ በተሳካ ሁኔታ ተሰርዟል

# appName
source: Adde Assistance App
am: አዴ እርዳታ መተግበሪያ

# noInternetTitle
source: No Internet Connection
am: የበይነመረብ ግንኙነት የለም

# noInternetMessage
source: Please check your internet connection and try again.
am: እባክዎ የበይነመረብ ግኍኙነትዎን ያረጋግጡ እና እንደገና ይሞክሩ።

# genderFemale
source: Female
am: ሴት

# genderMale
source: Male
am: ወንድ

# genderOther
source: Other
am: ሌላ

source: Edit Profile
am: መገለጫ አርትዕ

source: Theme Mode
am: ገጽታ ሁኔታ

# consultationFee
source: Consultation Fee: {amount} ETB
am: የምክክር ክፍያ: {amount} ብር

source: Unknown Name
am: ያልታወቀ ስም

# welcomeMessage
source: Welcome to the Adde Assistance App!
am: ወደ አዴ እርዳታ መተግበሪያ እንኳን ደህና መጡ!

# testCameraMic
source: Test your camera and microphone
am: ካሜራዎን እና ማይክሮፎንዎን ይሞክሩ

# yourDoctorWillJoin
source: Your doctor will join the meeting shortly
am: ዶክተርዎ በቅርቡ ወደ ስብሰባው ይቀላቀላል

# roomName
source: Room: {roomName}
am: ክፍል: {roomName}

# statusLabel
source: Status: {status}
am: ሁኔታ: {status}

# scheduledFor
source: Scheduled for: {date}
am: የተያዘለት: {date}

# videoConsultationTitle
source: Video Consultation
am: የቪዲዮ ምክክር

# videoConsultationMessage
source: Your video consultation is ready to start.
am: የእርስዎ የቪዲዮ ምክክር ለመጀመር ዝግጁ ነው።

# tabPending
source: Pending ({count})
am: በመጠባበቅ ላይ ({count})

# tabAccepted
source: Accepted ({count})
am: ተቀባይነት ያለው ({count})

# tabRejected
source: Rejected ({count})
am: ውድቅ የተደረገ ({count})

# statusPrefix
source: Status: {status}
am: ሁኔታ: {status}

# retryLabel
source: Retry
am: እንደገና ሞክር

# errorFetchingUserData
source: Error fetching user data: {error}
am: የተጠቃሚ መረጃ ማግኘት ላይ ስህተት: {error}

# errorFetchingComments
source: Error fetching comments: {error}
am: አስተያየቶችን ማግኘት ላይ ስህተት: {error}
