Repository: zwubishet/Adey_child_care_assistance_app
Catalog: lib/l10n/arb/lang_*.arb
Languages: am

source: Comment cannot be empty
am: አስተያየት ባዶ ሊሆን አይችልም

# errorAddingComment
source: Error adding comment: {error}
am: አስተያየት መጨመር ላይ ስህተት: {error}

source: Comment deleted successfully
am: አስተያየት በተሳካ ሁኔታ ተሰርዟል

# errorDeletingComment
source: Error deleting comment: {error}
am: አስተያየት መሰረዝ ላይ ስህተት: {error}

# postDetailTitle
source: Post Details
am: የመልእክት ዝርዝሮች

# profileOf
source: Profile of {fullName}
am: የ{fullName} መገለጫ

# likesCountText
source: {count} likes
am: {count} መውደዶች

# commentsCountText
source: {count} comments
am: {count} አስተያየቶች

# commentBy
source: Comment by {fullName}
am: አስተያየት በ{fullName}

# deleteCommentBy
source: Delete comment by {fullName}
am: አስተያየት በ{fullName} ሰርዝ

source: No comments yet
am: እስካሁን ምንም አስተያየቶች የሉም

# writeCommentHint
source: Write a comment...
am: አስተያየት ይፃፉ...

# sendCommentTooltip
source: Send comment
am: አስተያየት ላክ

source: Unable to load chat
am: ውይይት መጫን አልተቻለም

# chatServiceUnavailable
source: Chat service is currently unavailable
am: የውይይት አገልግሎት በአሁኑ ጊዜ አይገኝም

# pleaseLogInChat
source: Please log in to access chat
am: እባክዎ ውይይት ለመድረስ ይግቡ

# databaseError
source: Database error: {message}
am: የውሂብ ጎታ ስህተት: {message}

# networkError
source: Network error, please check your connection
am: የአውታረ መረብ ስህተት፣ እባክዎ ግንኙነትዎን ያረጋግጡ

# failedToSendMessage
source: Failed to send message: {error}
am: መልእክት መላክ አልተሳካም: {error}

# startChatting
source: Start chatting with {receiverName}
am: {receiverName} ጋር ውይይት ይጀምሩ

# chatUnavailableHint
source: Chat is currently unavailable
am: ውይይት በአሁኑ ጊዜ አይገኝም

# typeMessageHint
source: Type a message...
am: መልእክት ይፃፉ...

# sendMessageTooltip
source: Send message
am: መልእክት ላክ

# postBy
source: Post by {fullName}
am: መልእክት በ{fullName}

source: Edit Post
am: መልእክት አርትዕ

source: Delete Post
am: መልእክት ሰርዝ

source: Unlike post
am: መልእክት አለመውደድ

source: Like post
am: መልእክት ውደድ

source: Comment on post
am: በመልእክት ላይ አስተያየት ስጥ

# commentPost
source: Comment
am: አስተያየት

# imageSizeError
source: Image size exceeds 5MB limit
am: የምስል መጠን ከ5ሜባ በላይ ነው

# emptyContentError
source: Post content cannot be empty
am: የልጥፍ ይዘት ባዶ መሆን አይችልም

# userDataNotLoaded
source: User data not loaded, please try again
am: የተጠቃሚ ውሂብ አልተጫነም፣ እባክዎ እንደገና ይሞክሩ

# errorSavingPost
source: Error saving post: {error}
am: ልጥፍ ማስቀመጥ ላይ ስህተት: {error}

# closeTooltip
source: Close
am: ዝጋ

# editPostTitle
source: Edit Post
am: ልጥፍ አርትዕ

# postButton
source: Post
am: ለጥፍ

# updateButton
source: Update
am: አዘምን

# removeImageTooltip
source: Remove Image
am: ምስል አስወግድ

# addImageTooltip
source: Add Image
am: ምስል ጨምር

# createPostTitle
source: Create Post
am: ልጥፍ ፍጠር

# errorFetchingUser
source: Error fetching user: {error}
am: የተጠቃሚ ውሂብ ማግኘት ላይ ስህተት: {error}

source: Search posts
am: ልጥፎችን ፈልግ

# createNewPost
source: Create a new post
am: አዲስ ልጥፍ ፍጠር

source: Welcome Back
am: እንኳን ተመልሰሃል

source: Forget password?
am: የይለፍ ቃል ረሳህው?

source: Log In
am: ግባ

# noAccount
source: Don't have an account?
am: መለያ የለህም?

source: Register
am: መዝግብ

source: Sign in with Google
am: በGoogle ግባ

# emptyFieldsError
source: Please enter both email and password
am: እባክህ ኢሜይል እና የይለፍ ቃል አስገባ

# loginFailedError
source: Login failed. Please try again
am: መግባት አልተሳካም። እባክህ እንደገና ሞክር

# googleSignInCancelledError
source: Google Sign-In cancelled
am: Google መግባት ተሰርዟል

# googleSignInFailedError
source: Google Sign-In failed
am: Google መግባት አልተሳካም

# googleAuthFailedError
source: Google authentication failed
am: Google ማረጋገጫ አልተሳካም

# invalidEmailError
source: Please enter a valid email address
am: እባክህ ትክክለኛ ኢሜይል አድራሻ አስገባ

# invalidPasswordError
source: Password must be at least 6 characters
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች መሆን አለበት

# passwordLabel
source: Password
am: የይለፍ ቃል

# welcomeRegister
source: WELCOME
am: እንኳን ደህና መጣህ

# assistMessage
source: We Are Here, To Assist You!!!
am: እኛ እዚህ ነን፣ ለመርዳት!!!

# confirmPasswordLabel
source: Confirm Password
am: የይለፍ ቃል አረጋግጥ

# signUpButton
source: Sign Up
am: ተመዝገብ

# alreadyHaveAccount
source: Already have an account?
am: መለያ አለህ?

# loginLink
source: Login
am: ግባ

source: Sign Up with Google
am: በGoogle ተመዝገብ

# passwordsDoNotMatchError
source: Passwords do not match!
am: የይለፍ ቃሎች አይዛመዱም!

# googleSignUpCancelledError
source: Google Sign-Up cancelled.
am: Google መመ��ገብ ተሰርዟል።

# googleSignUpFailedError
source: Google Sign-Up failed. Please try again.
am: Google መመዝገብ አልተሳካም። እባክህ እንደገና ሞክር።

# googleSignUpTokenError
source: Google Sign-Up Error: Missing tokens.
am: Google መመዝገብ ስህተት፡ ቶከኖች ጠፍተዋል።

# signUpFailedError
source: Signup failed. Please try again.
am: መመዝገብ አልተሳካም። እባክህ እንደገና ሞክር።

# signUpSuccess
source: Signup successful!
am: መመዝገብ ተሳክቷል!

# signUpError
source: Error: {error}
am: ስህተት፡ {error}

# resetPasswordTitle
source: Reset Password
am: የይለፍ ቃል ዳግም አስጀምር

# resetPasswordHeader
source: Reset Your Password
am: የይለፍ ቃልህን ዳግም አስጀምር

# resetPasswordDescription
source: Enter your email to receive a reset link
am: የዳግም አስጀምር አገናኝ ለመቀበል ኢሜይልህን አስገባ

# resetLinkSentDescription
source: Check your email for the reset link
am: የዳግም አስጀምር አገናኝ ለማግኘት ኢሜይልህን ፈትሽ

# sendResetLinkButton
source: Send Reset Link
am: የዳግም አስጀምር አገናኝ ላክ

# emailSentButton
source: Email Sent
am: ኢሜይል ተልኳል

# emptyEmailError
source: Please enter your email address
am: እባክህ ኢሜይል አድራሻህን አስገባ

# resetEmailSentSuccess
source: Password reset email sent to {email}
am: የይለፍ ቃል ዳግም አስጀምር ኢሜይል ወደ {email} ተልኳል

# resetPasswordError
source: Error: {error}
am: ስህተት፡ {error}

# welcomePageTitle1
source: Adey Pregnancy And Child Care App
am: አዴ እርግዝና እና የልጅ እንክብካቤ መተግበሪያ

# welcomePageContent1
source: Welcome to Adey, your trusted partner for a safe and healthy pregnancy and child care journey.
am: እንኳን ወደ አዴ በደህና መጡ፣ ለአስተማማኝ እና ጤናማ እርግዝና እና የልጅ እንክብካቤ ጉዞ የእርስዎ ታማኝ አጋር።

# welcomePageContent2
source: Track your pregnancy and postpartum progress with tools that health status and give upgated recommedation.
am: እርግዝናዎን እና ድህረ-ወሊድ እድገትን በጤና ሁኔታ መከታተያ እና የተሻሻሉ ምክሮች መሣሪያዎች ይከታተሉ።

# welcomePageContent3
source: Access educational resources on maternal health, including articles, weekly tips, and daily notification.
am: በእናቶች ጤና ላይ የትምህርት መረጃዎችን ይድረሱ፣ ጽሑፎችን፣ ሳምንታዊ ምክሮችን እና የዕለታዊ ማሳወቂያዎችን ጨምሮ።

# welcomePageContent4
source: Connect with a community of users, share experiences, and receive support.
am: ከተጠቃሚዎች ማህበረሰብ ጋር ይገናኙ፣ ልምዶችን ያካፍሉ እና ድጋፍ ያግኙ።

# welcomePageContent5
source: Use our chatbot for instant responses and guidance on pregnancy and child care queries.
am: ለእርግዝና እና የልጅ እንክብካቤ ጥያቄዎች ፈጣን ምላሾች እና መመሪያ ለማግኘት የእኛን ቻትቦት ይጠቀሙ።

# skipButton
source: Skip
am: ዝለል

# nextButton
source: Next
am: ቀጣይ

# getStartedButton
source: Get Started
am: ጀምር

# skipSemantics
source: Skip onboarding
am: መግቢያውን ዝለል

# nextSemantics
source: Next page
am: ቀጣይ ገፅ

# getStartedSemantics
source: Get started
am: ጀምር

# onboardingPageSemantics
source: Onboarding page {pageNumber}
am: መግቢያ ገፅ {pageNumber}

# motherFormTitle
source: Welcome, Please Fill Below Form!
am: እንኳን ደህና መጡ፣ እባክዎ የሚከተለውን ቅጽ ይሙሉ!

# fullNameRequiredError
source: Full Name is required
am: ሙሉ ስም ያስፈልጋል

# selectGenderLabel
source: Select Gender
am: ፆታ ይምረጡ

# maleGenderOption
source: Male
am: ወንድ

# femaleGenderOption
source: Female
am: ሴት

# selectAgeLabel
source: Select Your Age
am: ዕድሜዎን ይምረጡ

# selectedAgeLabel
source: Selected Age: {age}
am: የተመረጠው ዕድሜ፡ {age}

# enterHeightLabel
source: Enter Your Height
am: ቁመትዎን ያስገቡ

# heightRequiredError
source: Height is required
am: ቁመት ያስፈልጋል

# heightInvalidError
source: Enter a valid number
am: ትክክለኛ ቁጥር ያስገቡ

# bloodPressureRequiredError
source: Blood Pressure is required
am: የደም ግፊት ያስፈልጋል

# bloodPressureInvalidError
source: Enter valid blood pressure (e.g., 120/80)
am: ትክክለኛ የደም ግፊት ያስገቡ (ለምሳሌ፣ 120/80)

# enterWeightLabel
source: Enter Your Weight
am: ክብደትዎን ያስገቡ

# weightRequiredError
source: Weight is required
am: ክብደት ያስፈልጋል

# weightInvalidError
source: Enter a valid number
am: ትክክለኛ ቁጥር ያስገቡ

# pregnancyStartDateLabel
source: Pregnancy Start Date
am: የእርግዝና መጀመሪያ ቀን

# pregnancyStartDateNotSet
source: Not set
am: አልተዘጋጀም

# pregnancyStartDateQuestion
source: When Did You Become Pregnant?
am: መቼ ነው እርጉዝ የሆኑት?

# pregnancyDurationLabel
source: Pregnancy Duration: {weeks} weeks and {days} days
am: የእርግዝና ጊዜ፡ {weeks} ሳምንታት እና {days} ቀናት

# healthConditionsLabel
source: Select Any Applicable Health Conditions
am: የሚመለከታቸውን የጤና ሁኔታዎች ይምረጡ

# healthConditionDiabetes
source: Diabetes
am: ስኳር በሽታ

# healthConditionHypertension
source: Hypertension
am: ከፍተኛ የደም ግፊት

# healthConditionAsthma
source: Asthma
am: አስም

# healthConditionHeartDisease
source: Heart Disease
am: የልብ በሽታ

# healthConditionThyroidIssues
source: Thyroid Issues
am: የታይሮይድ ችግሮች

# healthConditionOther
source: Other
am: ሌላ

# healthIssueDescriptionLabel
source: Describe Your Health Issue
am: የጤና ችግርዎን ይግለፁ

# submitButton
source: Submit
am: አስገባ

# confirmSubmissionTitle
source: Confirm Submission
am: የቅጽ ማስገባት አረጋግጥ

# confirmSubmissionMessage
source: Are you sure you want to submit the form?
am: ቅጹን ማስገባት እንደሚፈልጉ እርግጠኛ ነዎት?

# cancelButton
source: Cancel
am: መሰረዝ

# requiredFieldsError
source: Please fill all required fields!
am: እባክዎ ሁሉንም አስፈላጊ መስኮች ይሙሉ!

# invalidNumberError
source: Please enter valid numbers for weight and height!
am: እባክዎ ለክብደት እና ቁመት ትክክለኛ ቁጥሮችን ያስገቡ!

# formSubmitSuccess
source: Form submitted successfully!
am: ቅጹ በተሳካ ሁኔታ ተመዝግቧል!

# formSubmitError
source: Error submitting form: {error}
am: ቅጽ ማስገባት ላይ ስህተት፡ {error}

source: Pop-up Notifications
am: ብቅ-ወጪ ማሳወቂያዎች

source: Available Health Professionals
am: የሚገኙ የጤና ባለሙያዎች

# nursesLabel
source: Nurses
am: ነርሶች

# noNursesAvailable
source: No nurses available at the moment
am: በአሁኑ ጊዜ ምንም ነርሶች የሉም

# navigateToNurses
source: Navigate to nurses list
am: ወደ ነርሶች ዝርዝር ይሂዱ

# healthProfessionalsLabel
source: Health Professionals
am: የጤና ባለሙያዎች

# navigateToHealthProfessionals
source: Navigate to health professionals list
am: ወደ የጤና ባለሙያዎች ዝርዝር ይሂዱ

# selectHealthProfessionals
source: Select Health Professionals to view
am: ለመመልከት የጤና ባለሙያዎችን ይምረጡ

source: View Comments
am: አስተያየቶችን ተመልከት

# errorLikingPost
source: Error liking post: {error}
am: ልጥፍ መውደድ ላይ ስህተት፡ {error}

# errorSearchingPosts
source: Error searching posts: {error}
am: ልጥፎችን መፈለግ ላይ ስህተት፡ {error}

# errorFetchingPosts
source: Error fetching posts: {error}
am: ልጥፎችን ማግኘት ላይ ስህተት፡ {error}

# messageButton
source: Message
am: መልእክት

# postsTitle
source: Posts
am: ልጥፎች

# userAvatar
source: Avatar of {name}
am: የ{name} አቫታር

source: Sent message
am: የተላከ መልእክት

source: Received message
am: የተቀበለ መልእክት

# emptyTitleError
source: Post title cannot be empty
am: የልጥፍ ርዕስ ባዶ መሆን አይችልም

# postTitleHint
source: Enter post title
am: የልጥፍ ርዕስ ያስገቡ

# addCommentHint
source: Add a comment...
am: አስተያየት ያክሉ...

source: View Messages
am: መልዕክቶችን ይመልከቱ

# messagesTitle
source: Messages
am: መልዕክቶች

# noMessages
source: No messages yet
am: እስካሁን መልዕክቶች የሉም

# errorFetchingMessages
source: Error fetching messages: {error}
am: መልዕክቶችን መግኘት ላይ ስህተት፡ {error}

# errorFetchingConversations
source: Error fetching conversations: {error}
am: ውይይቶችን ማምጣት ላይ ስህተት፡ {error}

# noConversations
source: No conversations yet
am: እስካሁን ውይይቶች የሉም

# reportPostTitle
source: Report Post
am: ጽሁፍ ሪፖርት አድርግ

# reportPost
source: Report
am: ሪፖርት

# reportReasonHint
source: reason for reporting
am: የሪፖርት ምክንያት

# reportReasonRequired
source: Please provide a reason for reporting
am: እባክዎ የሪፖርት ምክንያት ያቅርቡ

# reportSubmitted
source: Report submitted successfully
am: ሪፖርት በተሳካ ሁኔታ ተመዝግቧል

# errorReportingPost
source: Error reporting post: {error}
am: ጽሁፍ ሪፖርት ማድረግ ላይ ስህተት፡ {error}

# reasonInappropriate
source: Inappropriate content
am: አግባብ ያልሆነ ይዘት

# reasonSpam
source: Spam
am: ስፓም

# reasonOffensive
source: Offensive language
am: አንገብጋቢ ቋንቋ

# reasonMisleading
source: Misleading information
am: ማታለል ወይም የተሳሳተ መረጃ

# reasonHarassment
source: Harassment or bullying
am: ማስፈራራት ወይም ጉልበተኝነት

# reasonCopyright
source: Copyright violation
am: የቅጂ መብት ጥሰት

# reasonOther
source: Other
am: ሌላ

# deletePostTitle
source: Delete Post
am: ጽሁፍ ሰርዝ

# deletePostConfirmation
source: Are you sure you want to delete this post? This action cannot be undone.
am: ይህን ጽሁፍ መሰረዝ እንደሚፈልጉ እርግጠኛ ነዎት? ይህ ተግባር መቀልበስ አይቻልም።

# deletePostSuccess
source: Post deleted successfully
am: ጽሁፍ በተሳካ ሁኔታ ተሰርዟል

# errorDeletingPost
source: Error deleting post: {error}
am: ጽሁፍ መሰረዝ ላይ ስህተት፡ {error}

# deleteButton
source: Delete
am: ሰርዝ

# errorDeletingPostWithComments
source: Cannot delete post because it has comments.
am: ጽሁፍ መሰረዝ አይቻልም ምክንያቱም አስተያየቶች አሉት።

source: You
am: እርስዎ

# imageMessage
source: Image
am: ምስል

# videoMessage
source: Video
am: ቪዲዮ

# documentMessage
source: Document
am: ሰነድ

# errorFetchingPost
source: Error fetching post: @error
am: ጽሁፍ በማምጣት ላይ ስህተት: @error

# verificationCodeSentSuccess
source: Verification code sent to {email}.
am: የማረጋገጫ ኮድ ወደ {email} ተልኳል።

# verificationCodeError
source: Failed to send or verify code: {error}
am: ኮድ መላክ ወይም ማረጋገጥ አልተሳካም፡ {error}

# invalidCodeError
source: Please enter a valid 6-digit verification code.
am: እባክዎ ትክክለኛ ባለ 6-አሃዝ የማረጋገጫ ኮድ ያስገቡ።

# emptyPasswordError
source: Please enter a new password.
am: እባክዎ አዲስ የይለፍ ቃል ያስገቡ።

# passwordUpdateSuccess
source: Password updated successfully.
am: የይለፍ ቃል በተሳካ ሁኔታ ተዘምኗል።

# verificationCodeDescription
source: Enter the 6-digit verification code sent to your email and your new password.
am: ወደ ኢሜይልዎ የተላከውን ባለ 6-አሃዝ የማረጋገጫ ኮድ እና አዲሱን የይለፍ ቃል ያስገቡ።

# passwordUpdateSuccessDescription
source: Your password has been updated successfully. You can now use it to sign in.
am: የይለፍ ቃልዎ በተሳካ ሁኔታ ተዘምኗል። አሁን ለመግባት መጠቀም ይችላሉ።

# verificationCodeLabel
source: Verification Code
am: የማረጋገጫ ኮድ

# newPasswordLabel
source: New Password
am: አዲስ የይለፍ ቃል

# verifyCodeButton
source: Verify Code & Update Password
am: ኮድ አረጋግጥ እና የይለፍ ቃል ዘምን

# sendVerificationCodeButton
source: Send Verification Code
am: የማረጋገጫ ኮድ ላክ

# passwordUpdatedButton
source: Password Updated
am: የይለፍ ቃል ተዘምኗል

source: Change Password
am: የይለፍ ቃል ቀይር

source: New Password
am: አዲስ የይለፍ ቃል

source: Confirm New Password
am: አዲስ የይለፍ ቃል ያረጋግጡ

# passwordTooShortError
source: Password must be at least 8 characters
am: የይለፍ ቃል ቢያንስ 8 ቁምፊዎች መሆን አለበት

source: Passwords do not match
am: የይለፍ ቃሎች አይዛመዱም

# passwordUpdateError
source: Failed to update password: {error}
am: የይለፍ ቃል መዘመን አልተሳካም፡ {error}

source: Submit
am: አስገባ

# errorLoggingOut
source: Failed to log out: {error}
am: መውጣት አልተሳካም፡ {error}

# enterOtpDescription
source: Enter the 6-digit code sent to your email and your new password.
am: በኢሜይልዎ የተላከውን 6-አሃዝ ኮድ እና አዲሱን የይለፍ ቃልዎን ያስገቡ።

# otpLabel
source: 6-Digit Code
am: 6-አሃዝ ኮድ

# submitOtpButton
source: Submit
am: አስገባ

# passwordUpdatedSuccess
source: Password updated successfully!
am: የይለፍ ቃል በተሳካ ሁኔታ ተዘምኗል!

# fullNameError
source: Please enter your full name
am: እባክዎ ሙሉ ስምዎን ያስገቡ

# ageEmptyError
source: Please enter your age
am: እባክዎ ዕድሜዎን ያስገቡ

# ageInvalidError
source: Please enter a valid age (0-120)
am: እባክዎ ተገቢ ዕድሜ ያስገቡ (0-120)

# weightEmptyError
source: Please enter your weight
am: እባክዎ ክብደትዎን ያስገቡ

# heightEmptyError
source: Please enter your height
am: እባክዎ ቁመትዎን ያስገቡ

# bloodPressureEmptyError
source: Please enter your blood pressure
am: እባክዎ የደም ግፊትዎን ያስገቡ

# pregnancyStartDateError
source: Please select your pregnancy start date
am: እባክዎ የእርግዝና መጀመሪያ ቀንዎን ይምረጡ

# healthIssueEmptyError
source: Please describe your health issue
am: እባክዎ የጤና ችግርዎን ይግለጹ

# signInSuccess
source: Signed in successfully!
am: በተሳካ ሁኔታ ገብተዋል!

# googleSignInConfigError
source: Google Sign-In configuration is missing
am: የGoogle መግቢያ ውቅር ጠፍቷል

# googleSignUpConfigError
source: Google Sign-Up configuration error
am: የGoogle መመዝገቢያ ውቅር ስህተት

source: Appointment Payment
am: የቀጠሮ ክፍያ

source: Payment Required
am: ክፍያ ያስፈልጋል

source: Doctor: {name}
am: ዶክተር: {name}

# paymentAutoFillMessage
source: Your details will be automatically filled
am: የእርስዎ ዝርዝሮች በራስ-ሰር ይሞላሉ

source: Initializing payment...
am: ክፍያ በማዘጋጀት ላይ...

# paymentInitializationFailed
source: Failed to initialize payment
am: ክፍያ ማዘጋጀት አልተሳካም

# checkPaymentStatus
source: Check Status
am: ሁኔታ ይመልከቱ

source: Payment Successful!
am: ክፍያ ተሳክቷል!

source: Payment Completed
am: ክፍያ ተጠናቋል

# paymentSuccessMessage
source: Your payment has been processed successfully. You can now join the video consultation.
am: የእርስዎ ክፍያ በተሳካ ሁኔታ ተሰርቷል። አሁን የቪዲዮ ምክክር መቀላቀል ይችላሉ።

# paymentProcessingMessage
source: Your payment is being processed. Please wait a moment.
am: የእርስዎ ክፍያ በሂደት ላይ ነው። እባክዎ ትንሽ ይጠብቁ።

source: Pay Now
am: አሁን ይክፈሉ

# paymentRequiredMessage
source: Payment is required before joining the video call
am: የቪዲዮ ጥሪ ከመቀላቀል በፊት ክፍያ ያስፈልጋል

# videoLinkPending
source: Video link will be available after payment
am: የቪዲዮ ሊንክ ከክፍያ በኋላ ይገኛል

# errorLoadingPaymentData
source: Error loading payment information
am: የክፍያ መረጃ በመጫን ላይ ስህተት

# paymentStillPending
source: Payment is still pending
am: ክፍያ አሁንም በመጠባበቅ ላይ ነው

# errorCheckingPayment
source: Error checking payment status
am: የክፍያ ሁኔታ በማረጋገጥ ላይ ስህተት

source: Paid
am: ተከፍሏል

# unpaid
source: Payment Required
am: ክፍያ ያስፈልጋል

source: Accepted
am: ተቀባይነት አግኝቷል

source: Pending
am: በመጠባበቅ ላይ

source: Declined
am: ተቋርጧል

source: Unknown
am: አይታወቅም

source: Appointment completed
am: ቀጠሮ ተጠናቋል

# waitingForDoctorResponse
source: Waiting for doctor's response
am: የዶክተር ምላሽ በመጠባበቅ ላይ

# appointmentDeclined
source: Appointment was declined
am: ቀጠሮ ተቋርጧል

source: My Appointments
am: የእኔ ቀጠሮዎች

source: No appointments scheduled
am: ምንም ቀጠሮ አልተያዘም

source: Unknown Doctor
am: ያልታወቀ ዶክተር

source: Could not launch video call
am: የቪዲዮ ጥሪ መጀመር አልተቻለም

source: Video link not available
am: የቪዲዮ ሊንክ አይገኝም

# cancelLabel
source: Cancel
am: ይሰርዙ

# consultationsFee
source: Consultation Fee
am: የምክክር ክፍያ

source: Typing...
am: እየፃፈ ነው...

source: Online
am: በመስመር ላይ

# lastSeen
source: Last seen {time}
am: መጨረሻ የታየው {time}

# sendImageTooltip
source: Send image
am: ምስል ላክ

# sendVoiceMessageTooltip
source: Send voice message
am: የድምጽ መልዕክት ላክ

# voiceMessagesNotSupported
source: Voice messages are not supported yet
am: የድምጽ መልዕክቶች እስካሁን አይደገፉም

source: Message pinned
am: መልዕክት ተሰካ

source: Message unpinned
am: መልዕክት ተለቀቀ

# errorPinningMessage
source: Failed to pin message: {error}
am: መልዕክት መሰካት አልተሳካም፡ {error}

# errorUnpinningMessage
source: Failed to unpin message: {error}
am: መልዕክት መለቀቅ አልተሳካም፡ {error}

source: Pin message
am: መልዕክት ሰካ

source: Unpin message
am: መልዕክት ንቀል

# replyMessage
source: Reply
am: መልስ

# copyMessage
source: Copy
am: ቅዳ

source: Message copied
am: መልዕክት ተቀድቷል

# deleteMessage
source: Delete
am: ሰርዝ

source: Message deleted
am: መልዕክት ተሰርዟል

# errorDeletingMessage
source: Failed to delete message: {error}
am: መልዕክት መሰረዝ አልተሳካም፡ {error}

# errorSendingImage
source: Failed to send image: {error}
am: ምስል መላክ አልተሳካም፡ {error}

source: View chat activity
am: የውይይት እንቅስቃሴ ተመልከት

source: Chat Activity
am: የውይይት እንቅስቃሴ

source: Edit Message
am: መልእክት አርትዕ

# failedToDeleteMessage
source: Failed to delete message: @error
am: መልእክት መሰረዝ አልተሳካም፡ @error

# editMessageHint
source: Edit your message...
am: መልእክትህን አርትዕ...

source: Cancel Edit
am: አርትዕ ሰርዝ

source: Save Edit
am: አርትዕ አስቀምጥ

source: Edited
am: ተስተካክሏል

source: Refresh
am: አድስ

source: Favorites
am: ተወዳጆች

# removeFavorite
source: Remove from Favorites
am: ከተወዳጆች አስወግድ

# addFavorite
source: Add to Favorites
am: ወደ ተወዳጆች ጨምር

# errorTitle
source: Something Went Wrong
am: የሆነ ችግር ተፈጥሯል

# errorOnboardingMessage
source: Failed to load onboarding content.
am: የመግቢያ ይዘት መጫን አልተሳካም።

# errorRetryButton
source: Try Again
am: እንደገና ይሞክሩ

# errorRegisterMessage
source: Failed to load registration page.
am: የምዝገባ ገፅ መጫን አልተሳካም።

# okButton
source: OK
am: እሺ

# successTitle
source: Success
am: ስኬት

# emailNullError
source: Email is required
am: ኢሜይል ያስፈልጋል

# errorCheckingNotifications
source: Failed to check notifications: {error}
am: የማሳወቂያዎችን መፈተሽ አልተሳካም፡ {error}

# errorSchedulingTips
source: Failed to schedule health tips: {error}
am: የጤና ምክሮችን መርሐግብር ማስያዝ አልተሳካም፡ {error}

# errorLoadingProfileImage
source: Failed to load profile image: {error}
am: የመገለጫ ምስል መጫን አልተሳካም፡ {error}
